#pragma once

// Задачи про кузнечика
//
// =============================
// ### Общая постановка задачи
// =============================
//  |___|___|___|___|___|
//  0   1   2   3   4   5
// Столбики, на нулевом столбике сидит кузнечик, он умеет прыгать и хочет
// допрыгать до n-ого столбика
// Количество способов(путей) ?

#include <bits/stdc++.h>
using namespace std;


namespace lec3::practice {

// =======================================================
// ### Кузнечик может прыгать на 1 и 2 столбика вперед
// (похоже на числа Фибоначи)
// =======================================================
//              *   *   X
//  |___|___|___|___|___|
//  0   1   2   3   4   n
//! Кузнечик начинает с 0-ого столбика
//! @param n - столбик для которого нужно допрыгать кузнечику
//! @returns число способов допрыгать
//! Кузнечик может прыгать на 1 и 2 столбика вперед
  size_t grasshopper_1_2(size_t n) {
    if(n == 0) return 1;
    vector<size_t> a (n+1,0);
    a[0] = 1;
    a[1] = 1;
    for(size_t i = 2; i <=n; ++i) {
      a[i] = a[i-2] + a[i-1];
    }
    return a[n];
  }

// =======================================================
// ### Кузнечик может прыгать на 1,2 ... k столбиков вперед
// ? Число способов допрыгать до n-ого столбика
// =======================================================
  //! @param n - столбик на который нужно попасть, начиная с 0-ого столбика
  //! @param k - кузнечик может делать прыжки длиной 1..k
  //! @returns количество способов
  size_t grasshopper(size_t n, size_t k) {
    vector<size_t> a(n+1,0);
    a[0] = 1;
    for(size_t i = 1; i <= n; ++i) {
      for(size_t j = 1; j <= min(i,k); ++j) {
        a[i] += a[i-j];
      }
    }
    return a[n];
  }


// =======================================================
// ### Кузнечик может прыгать на 1,2 ... k столбиков вперед
// ### + на некоторых столбиках сидят лягушки
// ? Число способов допрыгать до n-ого столбика
// =======================================================

//! @param frog_at_pos_i[k] == true of there is a frog at pos k
  size_t grasshopper_and_frogs(size_t n, size_t k,
                               const std::vector<bool> frog_at_pos_i) {
    if(frog_at_pos_i.front()) return 0;
    vector<size_t> a(n+1,0);
    a[0] = 1;
    for(size_t i = 1; i <= n; ++i) {
      for(size_t j = 1; j <= min(i,k) && !frog_at_pos_i[i]; ++j) {
        a[i] += a[i-j];
      }
    }
    return a[n];
  }

// =======================================================
// ### Кузнечик может прыгать на 1,2 ... k столбиков вперед
// ### + на каждом столбике число монет(D) которые кузнечик может взять(+D) / у
// него отнимают(-D)
// Хочет добраться от 0 до n-ой с минимальными потерями / max выигрышем
// =======================================================
//

//! @param money[i] - то кол-во монет, которое кузнечик получает/ отдает попадая
//! на i-ый столбик
  int grasshopper_and_money(size_t n, size_t k, const std::vector<int> money) {
    vector<int> a(n+1);
    a[0] = money[0];
    for(size_t i = 1; i <= n; ++i) {
      a[i] = a[i-1] + money[i];
      for(size_t j = 2; j <= min(i,k); ++j) {
        a[i] = max(a[i], a[i-j] + money[i]);
      }
    }
    return a[n];
  }

  void print(const std::vector<size_t> &from, size_t i);

// 1. Какие значения мы вычисляем
// a[i] - наибольшее количество монет, которое можно набрать добравшись до i-ого
// столбика
// from[i] - откуда лучше всего прийти на i-ый столбик, чтобы максимизировать число монет
//! @returns вектор id столбиков на которых нужно побывать для того, чтобы набрать макс монет
  std::vector<size_t> grasshopper_and_money_restoring_sequence_of_jumps(
          size_t n, size_t k, const std::vector<int> money) {
    vector<int> a(n+1,0);
    vector<size_t> from(n+1,0);
    a[0] = money[0];
    for(size_t i = 1; i <= n; ++i) {
      a[i] = a[i-1] + money[i];
      from[i] = i-1;
      for(size_t j = 2; j <= min(i,k); ++j) {
        if(a[i] < a[i-j] + money[i]) {
          a[i] = a[i-j] + money[i];
          from[i] = i - j;
        }
      }
    }
    std::vector<size_t> idxs;
    size_t i = n;
    while(i != 0) {
      idxs.push_back(i);
      i = from[i];
    }
    idxs.push_back(0);
    reverse(begin(idxs), end(idxs));
    return idxs;
  }

// либо ответ можно вывести с помощью рекурсии
// (использование стэка вашей операционной системы, вашего языка программирования)
  void print(const std::vector<size_t> &/*from*/, size_t /*i*/) {

  }
}